Open_Foam/Simulation_Src/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       159200;
    }

    inlet
    {
        type            patch;
        nFaces          300;
        startFace       160500;
      }

    outlet
    {
        type            patch;
        nFaces          300;
        startFace       159600;
    }

    top
{
    type            symmetryPlane;
    inGroups        1(symmetryPlane);
    nFaces          300;
    startFace       160200;
}

bottom
{
    type            symmetryPlane;
    inGroups        1(symmetryPlane);
    nFaces          300;
    startFace       159900;
}

    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       160800;
    }
)

// ************************************************************************* //
